# Эксперимент - полнофакторный 
# ПФЭ - Эксперимент в котором реализуются все 
# возможные сочетания уровней факторов

# определение точек факторного пространства, где следует проводить опыты
    
# Как узнать корректность коэффициентов?
# Необходимо задать одинаковые min и max интенсивности генераторов, а в
# обработчиках одинаковые min и max интенсивности. В получившемся
# уравнении коэффициенты возле x1 и x2 равны, а также коэффициенты возле x3
# и x4 тоже равны

# Кол-во уровней факторов = 2 (-1, 1)

# N = 2^2 (степень - кол-во факторов)

# Уравнние для линейной модели:
# y = b0x0 + b1x1 + b2x2

# Уравенине для частично-нелинейно модели:
# y = b0x0 + b1x1 + b2x2 + b3x1x2

# Cколько нужно опытов для определения коэффициентов линейной модели?
# 3 если (2^2) 4 (если 2ˆ3) (5, если 2ˆ4)

# Свойства матрицы планирования:
# * Симметричность относительно нулевого уровня - 
# Алгебраич. сумма элементов = 0

# * Отогональность - сумма попарных произведений 
# любых двух столбцов равна нулю - это выполняется -
# проще вычислять коэфф. уравнения  
# Дает: 1.Независимость вычисления коэффициентов 
# Каждый коэвв независимо друг от друга определям
# 2.точность выше - корреляционная матрица ... 
# 

# * нормированность - сумма квадратов элементов
# каждого столбца равна числу опытов

# диагональность - нули везде, кроме диагонали 

# коэффициент b12 характеризует взаимодействие факторов x1 и x2

# какое значение будет в нуле факторного пространства?
# значение, равное свободному члену (коэффициент a0)


# Какие преимущества у активного эксперимента?
# возможность предсказания количества опытов, которые следуют провести
# определение точек факторного пространства, где следует проводить опыты
# отсутствие проблем, связанных с выбором вида уравнения регрессии;
# возможность определения оптимальных параметров процесса экспериментально-статистическим методом;
# сокращение объёма опытных исследований.

# При пассивном эксперименте ставится большая серия опытов с поочередным(!) варьированием каждой из переменных.
# Активный эксперимент ставится по заранее составленному плану
# (планирование эксперимента), при этом предусматривается 
# одновременное изменение всех параметров, влияющих на процесс,
# что позволяет сразу установить силу взаимодействия параметров 
# и поэтому сократить общее число опытов.
# Активный эксп - уровни факторов заранее задаются
# заранее знаем параметры (зависимость выходных данный от выходных)