# что такое дфэ (часть ПФЭ)
# При многофакторном эксперименте, особенно когда число факторов больше шести (n > 6),
# число опытов планов ПФЭ 2^𝑛 (N = 2^𝑛) становится чрезмерным. Если нам не требуется
# определение всех коэффициентов неполного квадратичного полинома, то переходят к
# дробному факторному эксперименту (ДФЭ) – части полного факторного эксперимента.

# План ДФЭ строится, как и для плана ПФЭ, но с меньшим числом факторов. Оставшиеся
# факторы варьируются не произвольно, а так чтобы сохранялась ортогональность плана.
# Это обеспечивается, если оставшиеся факторы варьируются по выбранному генерирующему
# соотношению, например как произведение каких-либо факторов из первой группы. 

# Генерирующие соотношение - соотношение, определяющее каким взаимодействием можно принебречь
# Определяющий контраст (это - I=x1x2x3)

# что раньше определяем генерирующие соотношения или определяющий контраст (генерирующее соотношение)

# можно ли выбрать точки без генерирующих соотношений (да, но соблюдая ортогональность матрицы)
# что нам нам дает ортоганальность матрицы планирования 
# (независимость коэфицентов, возможность посчитать их отдельно и по формулам)

# ----
# зачем нам независимые коэффициенты регрессии ( корелляция близка к нулю?)
# (проверяет, отрицателен ли коэффициент при обработчике заявок)
# можно ли провести четверть-реплику (в 2^3-1 and 2^4-1 - нет, так как недостатчно опытов для определения всех коэффициентов)
# При выборе дробности плана k необходимо учитывать, 
# что число опытов должно быть больше числа членов уравнения.
# в каком случае полученный результат ДФЭ будет приближен к правде (когда взаиможействия b123 и т.д. близки к нулю)
# ----

# Генерирующее соотношение – соотношение, которое показывает какие
# взаимодействия заменены новыми факторами (оно генерирует или
# создает дробную реплику).
# Соотношение, определяющее каким взаимодействием можно пренебречь
# Генерирующим соотношением (генератором плана) называют соотношение, которое
# показывает, какое из взаимодействий признано незначимым и заменено новым
# фактором (например x3 = x1 * x2).

# как получаем определяющий контраст?
# умножаем обе части уравнения генерирующего соотношения на левую часть (фактор)

# ген отношение задает каким взаимодействием мы пренебрегать, а пренебрегать мы взаимодействием x1x2x3

# Генерирующим называется соотношение, которое показывает, какое из взаимодействий принято незначимым и заменено новым фактором 


